{
    "version": "https://jsonfeed.org/version/1",
    "title": "The Demo Sites",
    "description": "",
    "home_page_url": "https://the-demo-sites.dev",
    "feed_url": "https://the-demo-sites.dev/feed.json",
    "user_comment": "",
    "icon": "https://the-demo-sites.dev/media/website/logo-orange.png",
    "author": {
        "name": "AI WORM"
    },
    "items": [
        {
            "id": "https://the-demo-sites.dev/creating-a-website-dev-log.html",
            "url": "https://the-demo-sites.dev/creating-a-website-dev-log.html",
            "title": "Creating A Website [Dev Log] [0]",
            "summary": "Before one can do anything that requires an online presence. One must&hellip;",
            "content_html": "<p>Before one can do anything that requires an online presence. One must first have a plan. If one does not have a plan, one must be flexible to create a detail plan as they go or at the very list keep track of what they have done. <strong>This is</strong> what it means to accomplish something.</p>\n<p>If you are unable to figure out how you succeeded or where you failed... <strong>YOU HAVE FAILED</strong>. Why? Because you will be unable to replicate your process and prove otherwise.</p>\n<p>Most people, myself included, don't take the time to create a proper plan for the sole reason that they believe they will not show progress. Which is why I recommend taking the time to write down and keep a record of what you have accomplished, if you are not the type to plan first than take action. I am the kind that takes action and than plans or at least tries to.</p>\n<p>As such, <strong>WELCOME TO THE DEVELOPER LOG!</strong></p>\n<p>A series of post dedicated to showing off what I am doing and or accomplished for this specific site. <a href=\"https://the-demo-sites.dev\" target=\"_blank\" rel=\"noopener noreferrer\">The-Demo-Sites.Dev</a> a website dedicated to myself and any other who wishes to partake of it.</p>\n<p>For starters I wish to split this mini-series of \"Creating A Website\" (as the title of this post says) into multiple parts for various of reasons. I will now list them and keep on annoying any reader who has unfortunately found themselves here.</p>\n<ol>\n<li>I have just created this site as of September 23, 2024 despite buying this domain years ago and finally deciding to use Publii as my temporary CMS along with GitHub.</li>\n<li>I need content to help me figure out how to use Publii along with my personal thoughts and comments.</li>\n<li>I still wish to go back to my initial thoughts where I plan to create <strong>subdomains</strong> with various other <strong>CMS</strong> and such things to give a general and broad example of things. Thus giving me the name The-<strong>DEMO</strong>-Sites. I wish to provide demos of working code at the very least.</li>\n<li>I wish to describe how to get started with Publii as it was not as simple as they made it out to be because of reasons. (I mean there is a lot I can rant about when it comes to \"out of the box\" solutions)</li>\n<li>I doubt people will actually read this whole thing and just skim and look for things. So I'm doing those people a favor.</li>\n<li>I could have been posting on Medium but I'm cheap and I want to \"own\" my content and let people access it freely too.</li>\n<li>There are a lot of things to consider and I wish to educate people on the <strong>various</strong> solutions and problems that creating and hosting a website will bring up. (I mean you could pay people such as Shopify, Wordpress, Webflow, Wix, or Squarespace.) But people are cheap and I am cheap.</li>\n<li>I need to brag.</li>\n<li>I need content (Yes, I'm repeating myself. Get your own website!)</li>\n<li>Why not? There is a lot to write, little time to plan so I'm just winging it.</li>\n</ol>\n<h1>What Is The Dev Log?</h1>\n<p>Why that is a good question. I did my best to give a \"simple\" description in the opening statement but in short, its an up-to-date method of describing current problems or achievements as I begin my journey in creating <strong>this</strong> website.</p>\n<h1>Current Problems</h1>\n<p>When creating a new website and coming in with zero planning, the biggest problem I see is <strong>organization</strong>.</p>\n<h3>Why?</h3>\n<p>Because I am a visual and hands-on type of learner. If people just tell me how to do things, I might understand but never as good when I actually see them doing it. But is there a better way than to test my ability by trying out what I think I know and compare it to how I did? I think not.</p>\n<p>Also, I need to work on my communication skills. As you might be able to guess, when it comes to my writing ability, I lack the ability to write quick sentences that get to the point.</p>\n<p>Which brings me to my second question, \"How do you write?\".</p>\n<p>But first lets tackle this organizational problem.</p>\n<h3>Organization</h3>\n<p>Everything is and needs to be organized. The <strong>only</strong> reason why you will ignore this is due to your inability to see the benefits. For starters lets describe where organization is used in websites as this is the main theme.</p>\n<ol style=\"list-style-type: lower-greek;\">\n<li><strong>Front End</strong> - Also known as the user or viewer side of things</li>\n<li><strong>Back End</strong> - Otherwise referred to as <strong>The Den of Hell</strong>.</li>\n</ol>\n<p>Seems simple enough right?</p>\n<p>I did my best to break it down, but... </p>\n<p>If you know anything about web development or can recall a website you commonly use. You might be able to draw this conclusion.</p>\n<p><strong>Things Are Not As Simple As You Think!</strong></p>\n<p>If something is too good to be true, than it is. That simple.</p>\n<p>I mean 2 + 2 = 4. But if you ask a mathematician why, depending on the method used, things can get a little hairy when it comes to math terms.</p>\n<p>In the end, people are like numbers. They have their own rules in society and they have also been condition to think and behave in certain ways. This remains true when it comes to navigating a website.</p>\n<p>Some people know that by clicking the logo on a website takes them back to the homepage. Some don't. Most sites if not all, include this as a quick way to navigate things. Though in truth, it was mostly made for accessibility purposes. (If I was to talk about those things and why its important... I would never finish this post. So I will leave it to another day or just let you search it up online. Just search up \"web accessibility and why is it important\")</p>\n<p>People also expect that a company logo will be somewhere on the top of the page or the very bottom where the \"footer\" is located. So if you were to switch things up by having it in the center, it won't make much sense unless the context just happened to fit.</p>\n<p>When it comes to my site, the organization I am referring to includes but is not limited to: authors, tags, posts, pages and menus.</p>\n<p>This is because Publii the CMS I am using, has this as predefined sections. Something that other CMS will also have such as Wordpress. Thats because when it comes to creating a solution that is meant to tailor to \"everyone\" you may get extra functions you don't need or be left hanging with functions you do need.</p>\n<blockquote>\n<p>Example:</p>\n<p>When it comes to E-Commerce Stores, having a blog section would be seen as unnecessary.</p>\n<p>While in a blog site, having a Store section would be like... <strong>Why?</strong></p>\n</blockquote>\n<p>So whether you like it or not, you needed to decide the <strong>Primary</strong> purpose your site will perform. In total I have come up with <strong>three</strong> main reasons that almost all sites can fall into.</p>\n<ol style=\"list-style-type: lower-greek;\">\n<li>Communicate</li>\n<li>Interact</li>\n<li>Promote</li>\n</ol>\n<h6>Communication Websites</h6>\n<p>A communication website has but one goal. To <strong>communicate</strong> between the <strong>Business</strong> and the <strong>User</strong>. This communication can be displayed in various ways, but it short it comes down to the business displaying information about themselves and leaving a way for the user to reach back to them.</p>\n<p>Almost every type of website is a communication website. Why? Because you as an individual or entity have something you wish to share... and here is the most important part. Your site does not require your user to provide you with anything in order to achieve it.</p>\n<p>A blog does not require a user to create an account so that they can use it. A website like W3Schools does not need your money in order to display their <strong>FREE</strong> information. Wikipedia also does not require anything of you. In short, user Interaction is <strong>OPTIONAL</strong>. And it should remain optional.</p>\n<p>Sites that have a newsletter should also keep it optional. Why? Because if you are communicating with a user and you <strong>require</strong> them to give you something... that is not basic communication. Communication at its core is a mutual agreement to listen to one another with basic <strong>respect</strong>.</p>\n<p>You give, and receive willingly.</p>\n<h6>Interaction Sites</h6>\n<p>A site where <strong>User</strong> <strong>Interaction</strong> is <strong>required</strong>. Sites like Facebook, Youtube, Google.com and anything else you can think of, can not function if the user does not click anything. This includes online games.</p>\n<p>Most of these sites would not exist if the user did not provide content, or had a way to receive said content. Things like google drive you know?</p>\n<p>Their whole purpose is to provide a <strong>Function</strong> to any and all users they wish to grab a hold of. Most of these sites require custom solutions when it comes to creating an online user interface and even more custom organization to make the user experience the best.</p>\n<p>In the end, these types of sites <strong>need</strong> something from the user. And when something is given, that my friends, is a basic interaction at its core.</p>\n<h6>Sales Sites</h6>\n<p>Care to guess what sales sites are? They are nothing more than a sneaky little communication site dressed in the way an interaction site would be. The biggest hybrid and most hated of all website types.</p>\n<p><strong>Why?</strong></p>\n<p>Because they lure you in through various methods only to require you to give them something in return.</p>\n<p>Have you heard of click funnels?</p>\n<p>They offer \"free\" information of some sort only to require something like an email before its given to you.</p>\n<p>All those sites or blogs that give out free things, are simply <strong>selling</strong> something to you. Sales sites are the most growing types of sites out there and depending on the seller you could feel scammed or not. Not all sales sites are bad, but they can be. Just like any other site.</p>\n<p>It is not a communication site when its overall goal is to get the user to interact with it. If it has a pop-up that asks for your email, than its primary purpose is to buy your email in return for whatever it was asking for.</p>\n<p>But if the site simply has a \"sign-up\" for our newsletter somewhere on the page without a major attempt to get your interaction, then its giving you an option.</p>\n<p>Whenever the user may get the feeling that the site is trying to force them to do something, then its selling something. Email providers are selling you an email, Google is selling you various services with a free plan. In the end, many sites sell you something and it might be hard to say what it is, unless they really aren't.</p>\n<p>When ever the user is given preference to not do anything and the site still functions smoothly. Than its not a sales site or an interaction site.</p>\n<p>The only difference between a sales site and an interaction one is that the interaction one doesn't make money directly from the user.</p>\n<p>Most sites need to make money, some do it in the background with user data, others directly ask the user and some are simply there with the secondary objective to make money.</p>\n<p>So in short there are sites to make money or lose money. And depending on what you choose, it will be essential to design and organize your site to do so.</p>\n<p>I won't get into how to design your website by weighting in User Experience with the User Interface, but its important to balance both.</p>\n<p>This site uses the MONO Theme and has no real goal of selling or expecting user interactions. But we will always appreciate it. And by we I mean I.</p>\n<p>[Temporarly posting to see if this is live.]</p>",
            "author": {
                "name": "AI WORM"
            },
            "tags": [
            ],
            "date_published": "2024-09-23T18:17:07-04:00",
            "date_modified": "2024-09-23T19:41:51-04:00"
        }
    ]
}
